Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/atdf/ATSAMS70J21.atdf
        <register caption="PWM Channel Counter Register (ch_num = 0)" name="PWM_CCNT" offset="0x14" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0x00FFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Dead Time Register (ch_num = 0)" name="PWM_DT" offset="0x18" rw="RW" size="4">
          <bitfield caption="Dead-Time Value for PWMHx Output" mask="0x0000FFFF" name="DTH"/>
          <bitfield caption="Dead-Time Value for PWMLx Output" mask="0xFFFF0000" name="DTL"/>
        </register>
        <register caption="PWM Channel Dead Time Update Register (ch_num = 0)" name="PWM_DTUPD" offset="0x1C" rw="W" size="4">
          <bitfield caption="Dead-Time Value Update for PWMHx Output" mask="0x0000FFFF" name="DTHUPD"/>
          <bitfield caption="Dead-Time Value Update for PWMLx Output" mask="0xFFFF0000" name="DTLUPD"/>
        </register>
      </register-group>
      <register-group name="PWM_CMP" size="16">
        <register caption="PWM Comparison 0 Value Register" name="PWM_CMPV" offset="0x00" rw="RW" size="4">
          <bitfield caption="Comparison x Value" mask="0x00FFFFFF" name="CV"/>
          <bitfield caption="Comparison x Value Mode" mask="0x01000000" name="CVM"/>
        </register>
        <register caption="PWM Comparison 0 Value Update Register" name="PWM_CMPVUPD" offset="0x04" rw="W" size="4">
          <bitfield caption="Comparison x Value Update" mask="0x00FFFFFF" name="CVUPD"/>
          <bitfield caption="Comparison x Value Mode Update" mask="0x01000000" name="CVMUPD"/>
        </register>
        <register caption="PWM Comparison 0 Mode Register" name="PWM_CMPM" offset="0x08" rw="RW" size="4">
          <bitfield caption="Comparison x Enable" mask="0x00000001" name="CEN"/>
          <bitfield caption="Comparison x Trigger" mask="0x000000F0" name="CTR"/>
          <bitfield caption="Comparison x Period" mask="0x00000F00" name="CPR"/>
          <bitfield caption="Comparison x Period Counter" mask="0x0000F000" name="CPRCNT"/>
          <bitfield caption="Comparison x Update Period" mask="0x000F0000" name="CUPR"/>
          <bitfield caption="Comparison x Update Period Counter" mask="0x00F00000" name="CUPRCNT"/>
        </register>
        <register caption="PWM Comparison 0 Mode Update Register" name="PWM_CMPMUPD" offset="0x0C" rw="W" size="4">
          <bitfield caption="Comparison x Enable Update" mask="0x00000001" name="CENUPD"/>
          <bitfield caption="Comparison x Trigger Update" mask="0x000000F0" name="CTRUPD"/>
          <bitfield caption="Comparison x Period Update" mask="0x00000F00" name="CPRUPD"/>
          <bitfield caption="Comparison x Update Period Update" mask="0x000F0000" name="CUPRUPD"/>
        </register>
      </register-group>
      <register-group name="PWM">
        <register caption="PWM Clock Register" name="PWM_CLK" offset="0x00" rw="RW" size="4">
          <bitfield caption="CLKA Divide Factor" mask="0x000000FF" name="DIVA" values="PWM_CLK__DIVA"/>
          <bitfield caption="CLKA Source Clock Selection" mask="0x00000F00" name="PREA" values="PWM_CLK__PREA"/>
          <bitfield caption="CLKB Divide Factor" mask="0x00FF0000" name="DIVB" values="PWM_CLK__DIVB"/>
          <bitfield caption="CLKB Source Clock Selection" mask="0x0F000000" name="PREB" values="PWM_CLK__PREB"/>
        </register>
        <register caption="PWM Enable Register" name="PWM_ENA" offset="0x04" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Disable Register" name="PWM_DIS" offset="0x08" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Status Register" name="PWM_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Interrupt Enable Register 1" name="PWM_IER1" offset="0x10" rw="W" size="4" atomic-op="set:PWM_IMR1">
          <bitfield caption="Counter Event on Channel 0 Interrupt Enable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Enable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Enable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Enable" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Enable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Enable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Enable" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Enable" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWM Interrupt Disable Register 1" name="PWM_IDR1" offset="0x14" rw="W" size="4" atomic-op="clear:PWM_IMR1">
          <bitfield caption="Counter Event on Channel 0 Interrupt Disable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Disable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Disable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Disable" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Disable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Disable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Disable" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Disable" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWM Interrupt Mask Register 1" name="PWM_IMR1" offset="0x18" rw="R" size="4" atomic-op="read:PWM_IMR1">
          <bitfield caption="Counter Event on Channel 0 Interrupt Mask" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Mask" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Mask" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Mask" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Mask" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Mask" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Mask" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Mask" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWM Interrupt Status Register 1" name="PWM_ISR1" offset="0x1C" rw="R" size="4" atomic-op="clear:PWM_ISR1">
          <bitfield caption="Counter Event on Channel 0" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWM Sync Channels Mode Register" name="PWM_SCM" offset="0x20" rw="RW" size="4">
          <bitfield caption="Synchronous Channel 0" mask="0x00000001" name="SYNC0"/>
          <bitfield caption="Synchronous Channel 1" mask="0x00000002" name="SYNC1"/>
          <bitfield caption="Synchronous Channel 2" mask="0x00000004" name="SYNC2"/>
          <bitfield caption="Synchronous Channel 3" mask="0x00000008" name="SYNC3"/>
          <bitfield caption="Synchronous Channels Update Mode" mask="0x00030000" name="UPDM" values="PWM_SCM__UPDM"/>
          <bitfield caption="DMA Controller Transfer Request Mode" mask="0x00100000" name="PTRM"/>
          <bitfield caption="DMA Controller Transfer Request Comparison Selection" mask="0x00E00000" name="PTRCS"/>
        </register>
        <register caption="PWM DMA Register" name="PWM_DMAR" offset="0x24" rw="W" size="4">
          <bitfield caption="Duty-Cycle Holding Register for DMA Access" mask="0x00FFFFFF" name="DMADUTY"/>
        </register>
        <register caption="PWM Sync Channels Update Control Register" name="PWM_SCUC" offset="0x28" rw="RW" size="4">
          <bitfield caption="Synchronous Channels Update Unlock" mask="0x00000001" name="UPDULOCK"/>
        </register>
        <register caption="PWM Sync Channels Update Period Register" name="PWM_SCUP" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Update Period" mask="0x0000000F" name="UPR"/>
          <bitfield caption="Update Period Counter" mask="0x000000F0" name="UPRCNT"/>
        </register>
        <register caption="PWM Sync Channels Update Period Update Register" name="PWM_SCUPUPD" offset="0x30" rw="W" size="4">
          <bitfield caption="Update Period Update" mask="0x0000000F" name="UPRUPD"/>
        </register>
        <register caption="PWM Interrupt Enable Register 2" name="PWM_IER2" offset="0x34" rw="W" size="4" atomic-op="set:PWM_IMR2">
          <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Enable" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Enable" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match Interrupt Enable" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match Interrupt Enable" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match Interrupt Enable" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match Interrupt Enable" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match Interrupt Enable" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match Interrupt Enable" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match Interrupt Enable" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match Interrupt Enable" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update Interrupt Enable" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update Interrupt Enable" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update Interrupt Enable" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update Interrupt Enable" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update Interrupt Enable" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update Interrupt Enable" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update Interrupt Enable" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update Interrupt Enable" mask="0x00800000" name="CMPU7"/>
        </register>
        <register caption="PWM Interrupt Disable Register 2" name="PWM_IDR2" offset="0x38" rw="W" size="4" atomic-op="clear:PWM_IMR2">
          <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Disable" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Disable" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match Interrupt Disable" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match Interrupt Disable" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match Interrupt Disable" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match Interrupt Disable" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match Interrupt Disable" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match Interrupt Disable" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match Interrupt Disable" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match Interrupt Disable" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update Interrupt Disable" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update Interrupt Disable" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update Interrupt Disable" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update Interrupt Disable" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update Interrupt Disable" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update Interrupt Disable" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update Interrupt Disable" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update Interrupt Disable" mask="0x00800000" name="CMPU7"/>
        </register>
        <register caption="PWM Interrupt Mask Register 2" name="PWM_IMR2" offset="0x3C" rw="R" size="4" atomic-op="read:PWM_IMR2">
          <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Mask" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Mask" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match Interrupt Mask" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match Interrupt Mask" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match Interrupt Mask" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match Interrupt Mask" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match Interrupt Mask" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match Interrupt Mask" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match Interrupt Mask" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match Interrupt Mask" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update Interrupt Mask" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update Interrupt Mask" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update Interrupt Mask" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update Interrupt Mask" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update Interrupt Mask" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update Interrupt Mask" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update Interrupt Mask" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update Interrupt Mask" mask="0x00800000" name="CMPU7"/>
        </register>
